# Description Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..Description Property
Connector Class See Also
---
The description.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string Description { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Description As String
	Get
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
}
```

# See Also
Connector Class
Autodesk.Revit.DB Namespace